"""
Сколько существует чисел, пятеричная запись которых содержит 9 знаков и в которых ровно два раза чётные цифры стоят рядом,
при этом никакие три четные цифры не стоят рядом?
"""

k = 0
for x1 in "123456789":
    for x2 in "0123456789":
        for x3 in "0123456789":
            for x4 in "0123456789":
                for x5 in "0123456789":
                    w = x1 + x2 + x3 + x4 + x5
                    k = k + 1
                    w = w.replace("0", "ч")
                    w = w.replace("2", "ч")
                    w = w.replace("4", "ч")
                    w = w.replace("6", "ч")
                    w = w.replace("8", "ч")
                    
                    w = w.replace("1", "н")
                    w = w.replace("3", "н")
                    w = w.replace("5", "н")
                    w = w.replace("7", "н")
                    w = w.replace("9", "н")
                    if w.count("чч") == 0 and w.count("нн") == 0 and k%15 == 0:
                        print(k, w)

# 88350 нчнчн
# 88530 нчнчн
# 88590 нчнчн
# 88710 нчнчн
# 88770 нчнчн
# 88950 нчнчн