'''На ленте в соседних ячейках записано двоичное представление числа 2028 без ведущих нулей.
Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:

Определите результат работы программы. 
В ответе запишите получившееся на ленте число в десятичной системе счисления.'''

# print(bin(2028))
print(int('1111110110000', 2))