'''Значение арифметического выражения

3 * (3125**8) + 2 * (625**7) - 4 * (625**6) + 3 * (125**5) - 2 * (25**4) - 2024

записали в системе счисления с основанием 25. Сколько значащих нулей содержится в этой записи?

10 - A

'''
x=3 * (3125**8) + 2 * (625**7) - 4 * (625**6) + 3 * (125**5) - 2 * (25**4) - 2024
s=[]
while x!=0:
    s.append(x%25)
    x=x//25
    
print(s)
print(s.count(0))

# [1, 19, 21, 24, 22, 24, 24, 14, 0, 0, 0, 0, 21, 24, 1, 0, 0, 0, 0, 0, 3]